Revit 2027 API
DirectShapeType.RemoveAllReferenceObjects Method
 Removes all reference objects (if any) from the DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveAllReferenceObjects()
Public Sub RemoveAllReferenceObjects
public:
void RemoveAllReferenceObjects()
member RemoveAllReferenceObjects : unit -> unit
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace